In [1]:
import pandas as pd

## 예제 3-13 행 삭제

In [4]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')
airplane_info.head()

     기체번호       항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0  VP-BDK  Aeroflot  A320-214     0    20     0   120  140.0
1  VP-BWD  Aeroflot  A320-214     0    20     0   120  140.0
2  VP-BWE  Aeroflot  A320-214     0    20     0   120  140.0
3  VP-BWF  Aeroflot  A320-214     0    20     0   120  140.0
4  VP-BRZ  Aeroflot  A320-214     0    20     0   120  140.0

In [5]:
airplane_info.count()

기체번호    2178
항공사     2178
기종      2178
정원_F    2178
정원_C    2178
정원_W    2178
정원_Y    2178
총정원     2107
dtype: int64

In [6]:
import numpy as np

np.isnan => 결측값이 있니?

In [7]:
np.isnan(np.array([1,2,np.nan]))

array([False, False,  True])

총정원 열의 모든 원소에 적용할 방식을 apply 함수에서 지정한 함수를 통해 적용  
drop 하는 조건이 결측지 이외에 다양한 조건이 발생할 경우  
apply 함수를 통해 사용자 정의 함수를 호출 할 수 있음

In [10]:
airplane_info['총정원'].apply(np.isnan)

0       False
1       False
2       False
3       False
4       False
        ...
2173     True
2174     True
2175     True
2176     True
2177     True
Name: 총정원, Length: 2178, dtype: bool

In [11]:
airplane_info['총정원'].index

RangeIndex(start=0, stop=2178, step=1)

In [12]:
airplane_info['총정원'].index[[2107, 2108]]

Int64Index([2107, 2108], dtype='int64')

'총정원'의 열 값이 nan 인 index 를 보여준다  
복잡한 조건일 경우 apply 함수와 함께 적용

In [22]:
airplane_info.loc[2106:2115,['총정원']]

        총정원
2106  180.0
2107    NaN
2108    NaN
2109    NaN
2110    NaN
2111    NaN
2112    NaN
2113    NaN
2114    NaN
2115    NaN

In [13]:
index_nan = airplane_info['총정원'].index[airplane_info['총정원'].apply(np.isnan)]
index_nan

Int64Index([2107, 2108, 2109, 2110, 2111, 2112, 2113, 2114, 2115, 2116, 2117,
            2118, 2119, 2120, 2121, 2122, 2123, 2124, 2125, 2126, 2127, 2128,
            2129, 2130, 2131, 2132, 2133, 2134, 2135, 2136, 2137, 2138, 2139,
            2140, 2141, 2142, 2143, 2144, 2145, 2146, 2147, 2148, 2149, 2150,
            2151, 2152, 2153, 2154, 2155, 2156, 2157, 2158, 2159, 2160, 2161,
            2162, 2163, 2164, 2165, 2166, 2167, 2168, 2169, 2170, 2171, 2172,
            2173, 2174, 2175, 2176, 2177],
           dtype='int64')

In [14]:
airplane_info_nan = airplane_info.drop(index = index_nan)
airplane_info_nan

        기체번호        항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0     VP-BDK   Aeroflot  A320-214     0    20     0   120  140.0
1     VP-BWD   Aeroflot  A320-214     0    20     0   120  140.0
2     VP-BWE   Aeroflot  A320-214     0    20     0   120  140.0
3     VP-BWF   Aeroflot  A320-214     0    20     0   120  140.0
4     VP-BRZ   Aeroflot  A320-214     0    20     0   120  140.0
...      ...        ...       ...   ...   ...   ...   ...    ...
2102  EP-MNP  Mahan Air  A310-304     0    12     0   190  202.0
2103  EP-MMJ  Mahan Air  A310-304     0    12     0   190  202.0
2104  EP-MNF  Mahan Air  A310-304     0    12     0   190  202.0
2105  EP-MNX  Mahan Air  A310-304     0    12     0   190  202.0
2106  HA-LPJ   Wizz Air  A320-232     0     0     0   180  180.0

[2107 rows x 8 columns]

In [15]:
airplane_info_nan.shape

(2107, 8)

In [16]:
airplane_info_nan.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

dropna 는 간단한 조건(결측지의 유무에 의한 행, 또는 열 삭제)에 유리  
결측지만 가지고

In [17]:
airplane_info_dropna = airplane_info.dropna(axis = 0)
airplane_info_dropna

        기체번호        항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0     VP-BDK   Aeroflot  A320-214     0    20     0   120  140.0
1     VP-BWD   Aeroflot  A320-214     0    20     0   120  140.0
2     VP-BWE   Aeroflot  A320-214     0    20     0   120  140.0
3     VP-BWF   Aeroflot  A320-214     0    20     0   120  140.0
4     VP-BRZ   Aeroflot  A320-214     0    20     0   120  140.0
...      ...        ...       ...   ...   ...   ...   ...    ...
2102  EP-MNP  Mahan Air  A310-304     0    12     0   190  202.0
2103  EP-MMJ  Mahan Air  A310-304     0    12     0   190  202.0
2104  EP-MNF  Mahan Air  A310-304     0    12     0   190  202.0
2105  EP-MNX  Mahan Air  A310-304     0    12     0   190  202.0
2106  HA-LPJ   Wizz Air  A320-232     0     0     0   180  180.0

[2107 rows x 8 columns]

In [18]:
airplane_info_dropna.shape

(2107, 8)

In [19]:
airplane_info_dropna.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [20]:
ai = airplane_info['총정원']
ai.isnull().sum()

71

결측지가 있으면 다 지운다.

In [21]:
ai_d = ai.dropna()
ai_d.isnull().sum()

0

## 예제 3-14 중복값 삭제

In [23]:
import seaborn as sns

In [24]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [25]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [26]:
iris.shape

(150, 5)

In [27]:
iris.duplicated().sum()

1

iris 변수에서 중복된 정보만 출력

In [28]:
iris.loc[iris.duplicated()]

     sepal_length  sepal_width  petal_length  petal_width    species
142           5.8          2.7           5.1          1.9  virginica

In [32]:
iris.loc[(iris['sepal_length'] == 5.8) & (iris['sepal_width'] == 2.7) & (iris['petal_length'] == 5.1) & (iris['petal_width'] == 1.9),:]

     sepal_length  sepal_width  petal_length  petal_width    species
101           5.8          2.7           5.1          1.9  virginica
142           5.8          2.7           5.1          1.9  virginica

In [29]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [30]:
iris['species'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: species, dtype: bool

In [31]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

species 열의 모든 중복값이 삭제되고  
0, 50, 100 행의 유일한 값만 남게됨  
단, 기본 옵션으로 수행시 원본에 영향은 없음

In [33]:
iris['species'].drop_duplicates()

0          setosa
50     versicolor
100     virginica
Name: species, dtype: object

In [34]:
iris_dup = iris.copy()
iris_dup.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

iris_dup 1행의 모든 열의 내용을 iris 0행의 모든 열의 내용으로 할당한다

In [36]:
iris_dup.iloc[1, : ] = iris.iloc[0, : ]
iris_dup

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             5.1          3.5           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [37]:
iris_dup.duplicated().sum()

2

inplace=True 옵션은 원본에 영향을 미친다.

In [40]:
iris_dup.drop_duplicates(inplace=True)
iris_dup.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [41]:
iris_dup.shape

(148, 5)

In [42]:
iris_dup.duplicated().sum()

0